import React from "react";
import { ScrollView, StyleSheet, View } from "react-native";
import { useTheme } from "../context/ThemeContext"; // Assuming you have a theme context
import MyMarkDown from "./MyMarkdown";

const MarkdownGuide = ({ markdownContent }) => {
  const { theme } = useTheme(); // Use theme context if available

  return (
    <ScrollView>
      <MyMarkDown>
        {`

## دليل Markdown

مرحبًا بك في **دليل Markdown**! سيساعدك هذا المستند على فهم كيفية استخدام Markdown لتنسيق النص بسهولة.

## العناوين

استخدم رموز التجزئة (\`#\`) لإنشاء عناوين. يشير عدد علامات التجزئة إلى مستوى العنوان.

### مثال

\`\`\`markdown
# عنوان 1
## عنوان 2
### عنوان 3
\`\`\`

## تنسيق النص

يمكنك جعل النص **غامق**، *مائل*، أو **_كلاهما_** باستخدام الصيغ التالية:

- **غامق**: \`**النص**\` أو \`__النص__\`
- *مائل*: \`*النص*\` أو \`_النص_\`
- **_غامق ومائل_**: \`***النص***\` أو \`___النص___\`

## القوائم

### قائمة غير مرتبة

استخدم النجوم (\`*\`)، الإضافة (\`+\`)، أو الشرطات (\`-\`) لإنشاء قوائم غير مرتبة.

\`\`\`markdown
* عنصر 1
* عنصر 2
  * عنصر فرعي 1
  * عنصر فرعي 2
\`\`\`

### قائمة مرتبة

استخدم الأرقام متبوعة بنقطة (\`1.\`) لإنشاء قوائم مرتبة.

\`\`\`markdown
1. العنصر الأول
2. العنصر الثاني
   1. عنصر فرعي 1
   2. عنصر فرعي 2
\`\`\`



استخدم رمز أكبر من (\`>\`) لإنشاء اقتباسات.

\`\`\`markdown
> هذا اقتباس.
> يمكن أن يمتد لعدة أسطر.
\`\`\`

## خط أفقي

أنشئ خطًا أفقيًا باستخدام ثلاثة أو أكثر من الشرطات (\`-\`)، النجوم (\`*\`)، أو الخطوط السفلية (\`_\`).

`}
      </MyMarkDown>
    </ScrollView>
  );
};

export default MarkdownGuide;
