const data = [
  {
    question: "ما هي منصة عطاء؟",
    answer:
      "تهدف منصة عطاء إلى تمكين القطاع غير الربحي والتنموي، وتعزيز قيم الانتماء الوطني والمسؤولية الاجتماعية لدى أفراد المجتمع ومؤسساته. كما تسعى المنصة إلى تحقيق الموثوقية والشفافية والسهولة في عملية تقديم التبرعات، بالإضافة إلى تكريم المتميزين في العطاء الخيري والتنموي.",
  },
  {
    question: "ما هو دور منصة عطاء في دعم حملات التبرع بالدم؟",
    answer:
      "تعمل المنصة على نشر حملات التبرع بالدم بشكل واسع عبر الإنترنت، مما يسهل وصول المتبرعين إلى مراكز التبرع وتشجيعهم على المشاركة.",
  },
  {
    question: "كيف يمكنني تتبع استجابة المتبرعين للحملات؟",
    answer:
      "تتيح المنصة لوحة تحكم تعرض إحصائيات حول عدد المتبرعين، الحجوزات، وغيرها من البيانات المرتبطة بالحملات.",
  },
  {
    question: "هل يمكنني تعديل أو إلغاء حملة بعد نشرها؟",
    answer:
      "نعم، يمكن تعديل أو إلغاء الحملات من خلال لوحة التحكم، وسيتم إخطار المتبرعين بأي تغييرات تطرأ على الحملة.",
  },
  {
    question: "هل تتقاضى المنصة رسومًا من الوكالة؟",
    answer:
      "لا، تستفيد الوكالة الوطنية للتبرع بالدم من جميع خدمات عطاء بالمجان.",
  },
];

export default data;
