const data = [
  {
    question: "ما هي منصة عطاء؟",
    answer:
      "تهدف منصة عطاء إلى تمكين القطاع غير الربحي والتنموي، وتعزيز قيم الانتماء الوطني والمسؤولية الاجتماعية لدى أفراد المجتمع ومؤسساته. كما تسعى المنصة إلى تحقيق الموثوقية والشفافية والسهولة في عملية تقديم التبرعات، بالإضافة إلى تكريم المتميزين في العطاء الخيري والتنموي.",
  },
  {
    question: "كيف يمكنني تسجيل حساب لجمعيتي على المنصة؟",
    answer:
      "يمكنك تسجيل حساب عبر صفحة التسجيل المخصصة للجمعيات الخيرية. يتطلب ذلك تقديم مستندات رسمية تثبت تسجيل الجمعية للإستفادة من فترة تجريبية ثم يتطلب دفع إشتراك سنوي بمبلغ رمزي لدعم إستمرارية المنصة.",
  },
  {
    question: "ما هي الخدمات التي تقدمها المنصة للجمعيات الخيرية؟",
    answer:
      "+ إدارة حملات التبرع.\n" +
      "+ إعداد تقارير أداء المشاريع.\n" +
      "+ الوصول إلى لوحة تحكم لمتابعة أداء المشاريع وغيرها من اللوحات.\n" +
      "+ تعزيز شفافية التبرعات عبر نشر النتائج بشكل دوري.",
  },
  {
    question: "هل يمكنني تعديل بيانات حساب الجمعية؟",
    answer:
      "نعم، يمكن تعديل بيانات الحساب من خلال لوحة التحكم، أو عبر التواصل مع فريق الدعم الفني.",
  },
  {
    question: "كيف يمكنني الترويج لحملات التبرع الخاصة بجمعيتي؟",
    answer:
      "توفر المنصة أدوات تسويقية مثل برنامج سفراء عطاء أو إعداد حملات إعلانية مدفوعة.",
  },
  {
    question: "ماذا يحدث إذا أغلقت حساب جمعيتي؟",
    answer:
      "سيتم تحويل الحساب إلى وضع غير نشط، ولن تكون المعلومات متاحة للمتبرعين. يمكنك طلب إعادة تفعيل الحساب عند الحاجة.",
  },
  {
    question: "هل يمكنني استرجاع أموال التبرعات في حالة إلغاء مشروع؟",
    answer:
      "في حالة إلغاء المشروع، تُعاد الأموال إلى المتبرعين، ويتم إخطارهم بسبب الإلغاء.",
  },
];

export default data;
