const data = [
  {
    question: "ما هي منصة عطاء؟",
    answer:
      "تهدف منصة عطاء إلى تمكين القطاع غير الربحي والتنموي، وتعزيز قيم الانتماء الوطني والمسؤولية الاجتماعية لدى أفراد المجتمع ومؤسساته. كما تسعى المنصة إلى تحقيق الموثوقية والشفافية والسهولة في عملية تقديم التبرعات، بالإضافة إلى تكريم المتميزين في العطاء الخيري والتنموي.",
  },
  {
    question: "ما هي الخدمات التي تقدمها منصة عطاء للموردين؟",
    answer:
      "+ تسهيل التعاون مع الجمعيات الخيرية لبيع المنتجات أو تقديم الخدمات.\n" +
      "+ إدارة الطلبات وتتبع المعاملات من خلال لوحة تحكم مخصصة.\n" +
      "+ تعزيز رؤية المورد أو التاجر عبر نشر عروض المنتجات بمتجر عطاء.",
  },
  {
    question: "كيف يمكنني تسجيل حساب مورد؟",
    answer:
      "يمكنك إنشاء حساب مورد عبر صفحة التسجيل، مع تقديم معلومات حول نشاطك التجاري ومستندات التوثيق.",
  },
  {
    question: "هل يمكنني نشر عروض خاصة على المنصة؟",
    answer:
      "نعم، يمكن نشر عروض ترويجية على صفحة المتجر، وسيتم إعلام الجمعيات الخيرية المهتمة بها.",
  },
  {
    question: "كيف أضمن سلامة المعاملات المالية مع الجمعيات؟",
    answer:
      "تضمن منصة عطاء سلامة المعاملات المالية عبر بوابة دفع آمنة، مع توثيق كل عملية بيع أو خدمة مقدمة.",
  },
  {
    question: "ما هي الإجراءات المتبعة إذا واجهت مشكلة في استلام الدفعات؟",
    answer:
      "يمكنك التواصل مع فريق الدعم الفني لحل المشكلات المالية أو مراجعة حالة الدفع من خلال لوحة التحكم.",
  },
  {
    question: "ما هي نسبة المنصة من الدخل السنوي؟",
    answer:
      "تستفيد المنصة بنسبة 2% من الدخل السنوي للمورد أو التاجر عبر المنصة فقط.",
  },
];

export default data;
