import { View, Image } from "react-native";
import React, { useEffect } from "react";
import Text from "../../../components/Text";
import { useTheme } from "../../../context/ThemeContext";
import ScreensContainer from "../../../components/ScreensContainer";
import MyMarkDown from "../../../components/MyMarkdown";
import TypingText from "../../../components/TypingText";

export default function AboutAtaa({ navigation }) {
  const { theme } = useTheme();
  useEffect(() => {
    navigation.getParent().setOptions({
      headerShown: false,
    });
    navigation.setOptions({
      headerTitle: "الجهات الإشرافية",
      headerShown: false,
    });
  }, [navigation]);
  return (
    <ScreensContainer
      style={{
        paddingBottom: 100,
        justifyContent: "center",
        alignItems: "center",
      }}
    >
      <Image
        style={{
          width: "95%",
          height: 200,
          marginBottom: 20,
          borderRadius: 10,
        }}
        source={require("../../../assets/logo/logoBg.png")}
      />
      <Text
        style={{
          color: theme.secondaryColor,
        }}
      >
        التعريف بالمؤسسة
      </Text>

      <MyMarkDown>
        {`
يمثل التطبيق مبادرة لاستثمار البيانات وتطبيق تقنيات الذكاء الاصطناعي بهدف تعظيم تأثير المشاريع والخدمات التنموية وضمان استدامتها. يهدف التطبيق أيضًا إلى تقديم حلول تقنية متقدمة وبناء منظومة فعّالة تجمع بين الشركات، القطاعات الحكومية، والمؤسسات غير الربحية. الغاية من هذه الجهود هي تعزيز دور الجزائر كرائدة في مجال الأعمال التنموية والخيرية، وزيادة مساهمة القطاع غير الربحي في الناتج المحلي الإجمالي، وتعزيز الانتماء الوطني والمسؤولية الاجتماعية للأفراد والمؤسسات في المجتمع. ويسعى التطبيق أيضًا إلى توفير طرق سهلة وشفافة للتبرعات، وتقديم الشكر والتقدير للأفراد والمؤسسات المتميزة في المجال الخيري والتنموي.

    
## الرؤية:
تمكين القطاع الخيري والتنموي رقميا و تكنولوجيا لتعزيز المشاركة المجتمعية الفعالة وتعظيم الأثر وصناعة التغيير.

## الرسالة:
تمكين قطاع العمل الخيري والتنموي الاجتماعي في الجزائر من خلال الاستفادة من البيانات والمعلومات لتفعيل الربط الرقمي بين المتبرعين والجماعات الخيرية والتسويق للعمل الخيري وتقديم الإرشادات لكل الطرفين.

## الأهداف:
- إنشاء منصة رقمية تفاعلية، آمنة وسهلة الاستخدام.
- تمكين المتبرعين من المشاركة في مختلف الأنشطة الخيرية عبر المنصة.
- ضمان الشفافية ورفع تقارير عن أنشطة المنصة والقطاع.
- اعتماد المنصة من قبل المتبرعين وجهات جمع التبرعات من خلال التسويق.
- تمثيل احتياجات الأشخاص وإيصال أصواتهم لمن يمكنهم المساعدة.
- توظيف الذكاء الاصطناعي والرقمنة والشباب الكفء.
- تنسيق الخدمات بين أصحاب المصلحة في القطاع الخيري.
- إعداد قاعدة بيانات خاصة بالقطاع الخيري والتنموي.
- إبرام شراكات محلية ودولية لتحسين أداء القطاع.
- خلق منظومة متكاملة تضمن تعزيز التعاون بين القطاعات الحكومية والخاصة وغير الربحية.
- تعزيز أداء ومكانة الجزائر في المؤشرات العالمية الخاصة بالعمل الخيري.
- تعزيز الحملات التسويقية المستهدفة لمشاركين جدد في الأنشطة الخيرية.

## المزايا:
- **السهولة**: تبرع في أي وقت وأي مكان.
- **التنوع**: مجالات متنوعة تغطي العديد من جوانب العمل الخيري.
- **السرعة**: خيارات متعددة للتبرع مع خاصية التبرع السريع دون تصفح للفرص.
- **الأمان**: نطبق أعلى المعايير التقنية في أمن المعلومات.
- **الشفافية**: نتبع أعلى معايير الشفافية في مختلف ممارساتنا الإدارية والمالية.
- **التقارير**: العناية بالمتبرعين من خلال تزويدهم بتقارير تعكس أثر تبرعاتهم.
`}
      </MyMarkDown>
    </ScreensContainer>
  );
}
