import { View, Image, TouchableOpacity } from "react-native";
import React from "react";
import blooodDonationImg from "../../../assets/images/image47.png";
import ScreensContainer from "../../../components/ScreensContainer";
import Text from "../../../components/Text";
import Icon from "../../../components/Icon";
import MyMarkDown from "../../../components/MyMarkdown";
export default function BloodDonationCondittion({ navigation }) {
  const handleGoBack = () => {
    navigation.goBack();
  };
  return (
    <ScreensContainer>
      <TouchableOpacity
        onPress={handleGoBack}
        style={{ position: "absolute", top: 10, left: 10, zIndex: 1 }}
      >
        <Icon.Ionicons
          name="chevron-back-circle-outline"
          size={30}
          color="#000"
        />
      </TouchableOpacity>
      <Image
        source={blooodDonationImg}
        style={{ width: "100%", height: 225, borderRadius: 10 }}
      />

      <MyMarkDown>
        {`
       تُعد عملية التبرع بالدم من الأنشطة الإنسانية الهامة التي تسهم في إنقاذ الأرواح. ولكي يتمكن الشخص من التبرع بالدم، هناك مجموعة من الشروط العامة التي يجب أن يستوفيها. تختلف بعض الشروط حسب الدولة أو المركز الصحي، ولكن الشروط التالية تُعد من أكثر الشروط شيوعًا:

1.**العمر**: يجب أن يكون المتبرع في الفئة العمرية المسموح بها، والتي عادة ما تكون بين 17 و60 عامًا. في بعض الحالات، قد يُسمح بالتبرع للأشخاص الذين تجاوزوا سن الستين، بشرط أن يتمتعوا بصحة جيدة ويُوافق الطبيب المختص.

2.**الوزن**: من الضروري أن يكون وزن المتبرع مناسبًا، حيث يجب ألا يقل عن 50 كيلوغرامًا. هذا لضمان أن الجسم قادر على تحمل فقدان الدم دون تأثيرات صحية سلبية.

3.**الصحة الجسدية**: ينبغي أن يتمتع المتبرع بحالة صحية جيدة. يجب أن يكون خالياً من الأمراض المعدية مثل الإيدز، الالتهاب الكبدي، والملاريا. يُنصح المتبرع بالراحة الجيدة والنوم الكافي قبل التبرع لضمان صحة وسلامة عملية التبرع.

4.**ضغط الدم**: يجب أن يكون ضغط الدم في النطاق الطبيعي عند التبرع. في حال كان المتبرع يعاني من اضطرابات في ضغط الدم، يجب استشارة الطبيب للتأكد من ملاءمته للتبرع.

5.**مستويات الهيموغلوبين**: يجب أن تكون مستويات الهيموغلوبين ضمن النطاق الطبيعي. الهيموغلوبين هو البروتين الذي يحمل الأكسجين في الدم، ويجب أن تكون مستوياته كافية لضمان عدم تعرض المتبرع للدوار أو الإعياء بعد التبرع.

6.**التاريخ الصحي**: من المهم أن يشارك المتبرع تاريخًا صحيًا كاملاً مع المركز الطبي. بعض الأمراض السابقة مثل السرطان، أو إجراء عمليات جراحية كبرى، قد تتطلب فترة انتظار قبل أن يصبح المتبرع مؤهلاً للتبرع.

7.**السفر والإقامة في مناطق معينة**: قد تكون هناك قيود على التبرع بالدم إذا كان المتبرع قد سافر مؤخرًا إلى مناطق تنتشر فيها أمراض معينة، مثل مناطق انتشار الملاريا. يجب الانتظار لفترة معينة بعد العودة من السفر قبل التبرع.

8.**تاريخ التبرع السابق**: يجب أن يكون هناك فترة زمنية محددة بين كل عملية تبرع بالدم، وغالبًا ما تكون هذه الفترة 8 أسابيع للتبرع بالدم الكامل. يجب على المتبرع التأكد من أنه قد مر بما يكفي من الوقت منذ آخر تبرع.

9.**الحمل والرضاعة**: بالنسبة للنساء، يُمنع التبرع بالدم خلال فترة الحمل، ويُفضل الانتظار لعدة أشهر بعد الولادة قبل التبرع. الرضاعة الطبيعية قد تتطلب أيضًا تأجيل التبرع.

10.**نمط الحياة**: يلعب نمط الحياة دورًا كبيرًا في تحديد أهلية التبرع. قد تؤثر العادات مثل التدخين، وتعاطي المخدرات، أو استهلاك الكحول بكثرة على قدرة الشخص على التبرع. يُفضل أن يكون المتبرع ملتزمًا بنمط حياة صحي لضمان سلامة دمه.

11.**تناول الأدوية**: بعض الأدوية قد تمنع التبرع بالدم مؤقتًا أو بشكل دائم. من المهم إبلاغ المركز الطبي بجميع الأدوية التي يتناولها المتبرع قبل عملية التبرع.

12.**الحساسية والتطعيمات**: يجب على المتبرع إعلام المركز الطبي بأي حساسية يعاني منها، أو إذا كان قد تلقى أي تطعيمات مؤخرًا، حيث قد يتطلب ذلك تأجيل التبرع لفترة معينة.

تأكد دائمًا من التواصل مع المركز الصحي أو بنك الدم للتعرف على الشروط الخاصة بالمكان الذي تنوي التبرع فيه، لضمان أن تكون مؤهلاً للتبرع وتساهم في إنقاذ الأرواح بأمان.


`}
      </MyMarkDown>
    </ScreensContainer>
  );
}
